Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེ་བསམ་གཏན་གང་དང་གང་སྐྱེས་པ་དེ་དང་དེ་འགོག་པའི་ཆོས་ཅན་དུ་མཐོང་ངོ་། །
en: Whichever state of concentration he created, he recognized that it would eventually cease.

source: དེ་བསམ་གཏན་གྱི་རྣམ་པ་ཐམས་ཅད་འགོག་པའི་ཆོས་ཅན་དུ་ཤེས་ཤིང་སྲིད་པ་དང་འགྲོ་བ་ཐམས་ཅད་ལ་ཞུམ་པ་མེད་པའི་འདུ་ཤེས་བྱུང་ངོ་། །
en: Thus he understood that any type of concentration will at one point cease, and thus he gained an attitude of fearlessness with regard to the entirety of existence and all beings.

source: དེས་ན་དེ་མི་གནས་པའི་སེམས་ཀྱི་རྒྱུན་འགོག་པ་ལ་གཞོལ་བས་འཆི་བའི་དུས་བྱེད་པ་ན་བསྐལ་པ་དགུ་བཅུ་རྩ་དྲུག་ཏུ་མངལ་གྱི་གནས་སུ་མི་འཇུག་སྟེ།
en: He exerted himself in bringing the continuity of the unsteady mind to cessation to such an extent that when the time of death came, he did not enter a womb for ninety-six eons.

source: རྟག་པར་རྒྱུན་ཏུ་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ། །
en: Instead he always took birth miraculously.

source: དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཐོགས་མེད་དཔལ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the sage Unhindered Glory was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཐོགས་མེད་དཔལ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Unhindered Glory.

source: དེའི་ཚེ་ང་ཉིད་བསྐལ་པ་དགུ་བཅུ་རྩ་དྲུག་ཏུ་མངལ་གྱི་གནས་སུ་མ་ཞུགས་སོ། །
en: In those times, for ninety-six eons I did not enter a womb.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་འདུ་བྱེད་ཐམས་ཅད་འགོག་པའི་འདུ་ཤེས་སུ་བྱ་སྟེ་བྲལ་བར་མི་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should perceive all conditioned things as being transient and never stray from such a perception.

source: མཽད་གལ་གྱི་བུ་ངས་བསམ་གཏན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Furthermore, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous roots of virtue in order to understand the path that leads to cessation as related to concentration.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། སྟོན་པ་སྤྱན་བཟང་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a teacher named Excellent Vision.

source: དེའི་འདོད་པའི་ཁམས་ནི་འདོད་པའི་སྐྱོན་གྱིས་གནོད་པར་མཐོང་།
en: He perceived the desire realm to be marred by the flaws of desire,

source: གཟུགས་ཀྱི་ཁམས་ནི་གཟུགས་ཀྱི་སྐྱོན་གྱིས་གནོད་པར་མཐོང་།
en: the form realm to be marred by the flaws of form,

source: གཟུགས་མེད་པའི་ཁམས་ནི་གཟུགས་མེད་པའི་སྐྱོན་གྱིས་གནོད་པར་མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: and the formless realm to be marred by the flaws of formlessness.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་མགོན་མེད་ཅིང་འདྲེན་པ་མེད་དེ།
en: With this in mind, he thought, ‘Alas! These beings have no savior and no guide.

source: གང་དང་གང་ལ་གནས་པར་བྱེད་པ་དེ་དང་དེས་གནོད་དེ།
en: Wherever they dwell, they are harmed by their dwelling place.

source: གང་བདག་གིས་འདུ་བྱེད་ཐམས་ཅད་ལ་གནས་པར་མི་བྱ་སྟེ།
en: Thus I will not dwell within anything conditioned.

source: གནས་པ་མེད་ན་གཡོ་བར་མི་འགྱུར་རོ་སྙམ་མོ། །
en: Without dwelling there can be no fluctuation.’

source: དེ་ཆོས་ཐམས་ཅད་ལ་མི་གནས་པའི་བསམ་གཏན་ཅན་ནི་སེམས་ཅན་ལ་སྙིང་རྗེ་ཆེན་པོ་འཐོབ་པོ། །
en: In that way, with the concentration of not dwelling on any phenomena, he achieved great compassion for sentient beings.

source: དེ་ཤེས་པ་ཁོང་དུ་ཆུད་ནས་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ། །
en: With the knowledge he had realized, he taught correctly to beings.

source: དེའི་ཆོས་དེ་བསྟན་པ་ལས་སེམས་ཅན་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དག་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ལ་བཙུད་ཅིང་། དེ་མི་གནས་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: Due to his teachings, he was able to lead innumerable billions of beings to unimpeded wisdom while reaching non-dwelling nirvāṇa.

source: དེའི་ཚེ་དེའི་དུས་ན་སྟོན་པ་སྤྱན་བཟང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the teacher Excellent Vision was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་སྟོན་པ་སྤྱན་བཟང་ཞེས་བྱ་བར་གྱུར་ཏེ། ངས་འདོད་པ་དེ་ལས་ངེས་པར་འབྱུང་བ་བསྟན་ཏོ། །
en: Because in those days I was the teacher Excellent Vision who taught emancipation from desire.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སྐྱེ་བ་དང་འཇིག་པའི་ཆོས་ལ་རྣལ་འབྱོར་དུ་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should apply themselves to the phenomena that arise and cease.”

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་ཐར་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created innumerable roots of virtue in order to understand liberation.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་དབུགས་འབྱིན་སྩོལ་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: Long ago in limitless cyclic existence, Maudgalyāyana, long before even the distant past there was a thus-gone one named Revitalizer.

source: དེ་ལྷ་དང་ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་རྒ་བ་དང་ན་བས་གཟིར་བའི་དབུགས་སྩོལ་བར་མཛད་ཅིང་རྒ་བ་དང་ན་བ་ལས་འདའ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: He revitalized those in the god and demigod realms who were tormented by old age and illness, and taught them the Dharma so they could transcend old age and illness.

source: རྒ་བ་དང་ན་བ་ལས་རབ་ཏུ་གྲོལ་བའི་སེམས་ཅན་རྣམས་འཇིགས་པ་མེད་པར་འགྱུར་རོ། །
en: In doing so the beings who were liberated from old age and illness became fearless.

source: ཆགས་པར་འགྱུར་བ་རྣམས་ལ་མི་ཆགས།
en: He made those who had been attached free from attachment,

source: སྡང་བར་འགྱུར་བ་རྣམས་ལ་མི་སྡང་།
en: those who had been angry free from anger,

source: རྨོངས་པར་འགྱུར་བ་རྣམས་ལ་མི་རྨོངས།
en: and those who had been deluded free from delusion.

source: བསམ་གཏན་རྣམས་ལ་མི་ཆགས།
en: He made them not attached to states of concentration,

source: ཟད་པར་གྱི་སྐྱེ་མཆེད་རྣམས་ལ་མི་ཆགས།
en: not attached to the sphere of totality,

source: མཐར་གྱིས་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་མི་ཆགས་ཏེ།
en: and not attached to the attainments of the successive stages.

source: དེ་སེམས་རྣམ་པར་གྲོལ་ཞིང་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་འདི་ནི་རྣམ་པར་ཐར་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: With his mind free and emancipated, he was known as having knowledge of liberation.

source: དེ་རྣམ་པར་ཐར་པ་བརྒྱད་པོ་དེ་དག་རྟོགས་པར་བྱས་ནས་ཆོས་སྟོན་ཏོ། །
en: Once he had realized these eight liberations, he went on to teach the Dharma.

source: དེའི་ཚེ་རྒྱལ་པོ་དགྲ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དབང་ཕྱུག་ཞིག་བྱུང་ངོ་། །
en: At that time there was also a king named Vanquisher of All Enemies who reigned over a great trichiliocosm.

source: དེ་སྐྱེ་བོའི་ཚོགས་མང་པོ་དང་ལྷན་ཅིག་ཁམས་ཀྱི་རྒྱལ་ཕྲན་སྟོང་ཕྲག་དྲུག་ཅུ་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དབུགས་འབྱིན་སྩོལ་བ་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Along with numerous assemblies of commoners and sixty thousand vassal kings, he went to visit the thus-gone one named Revitalizer.

source: དེ་བཞིན་གཤེགས་པ་དབུགས་འབྱིན་སྩོལ་བ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །
en: Once there, he bowed his head at the feet of the thus-gone Revitalizer before sitting off to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་རྒྱལ་པོ་དགྲ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པ་དེ་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དབུགས་འབྱིན་སྩོལ་བས་རྣམ་པར་ཐར་པ་བརྒྱད་བསྟན་ཏོ། །
en: As King Vanquisher of All Enemies was sitting off to the side, the thus-gone Revitalizer taught him the eight liberations.

source: དེས་རྣམ་པར་ཐར་བ་བརྒྱད་ཐོས་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་སྟེ་ཕུལ་ནས་
en: Once he had heard about the eight liberations, he filled the great trichiliocosm with the seven precious substances and offered it all to the Blessed One.

source: དེ་ཁམས་ཀྱི་རྒྱལ་ཕྲན་དང་ལྷན་ཅིག་ཏུ་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། །
en: Then, along with all the vassal kings, he took ordination and gave up the life of a householder to be a mendicant.

source: དེར་ཁམས་ཀྱི་རྒྱལ་ཕྲན་སྟོང་ཕྲག་དྲུག་ཅུ་པོ་དེ་དག་རྣམ་པར་ཐར་པ་བརྒྱད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: All sixty thousand vassal kings of his realm actualized the eight liberations.

source: རྒྱལ་པོ་དགྲ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པ་དེ་ནི་མ་གཏོགས་སོ། །
en: Only King Vanquisher of All Enemies did not.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དགྲ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time King Vanquisher of All Enemies was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དགྲ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱའོ། །
en: In those days I was King Vanquisher of All Enemies.

source: དེས་ན་ང་རྣམ་པར་ཐར་པ་བརྒྱད་ཐོས་པས་སྲིད་པ་ཐམས་ཅད་ལ་མི་གནས་སོ། །
en: Once I had learned of the eight liberations, I no longer dwelled in any form of existence.

source: སྲིད་པ་དང་། འགྲོ་བ་དང་། འཆི་བ་དང་། སྐྱེ་བའི་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོའི་དབང་གིས་བསྐལ་པ་གྲངས་མེད་པ་ཕྲག་བཅྭ་བརྒྱད་དུ་འཁོར་བ་ལ་གནས་ཤིང་། འཁོར་བའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་བསམས་སོ། །
en: Out of my great compassion for all beings who live, migrate, die, and take rebirth, I remained in cyclic existence for eighteen incalculable eons, intent on the welfare of beings in cyclic existence.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་མི་གནས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should not dwell on anything.

source: མཽད་གལ་གྱི་བུ་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་མི་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།། །།
en: Maudgalyāyana, bodhisattvas who do not dwell in any state of equipoise soon fully awaken to unsurpassed and perfect buddhahood.

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་ཐར་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡུལ་ཉམ་ང་བ་ལ་ཞེན་པ་རྣམས་ཆགས་པ་ཐམས་ཅད་ལས་བདག་གིས་ཇི་ལྟར་སེམས་རབ་ཏུ་གྲོལ་བར་བྱ་སྙམ་ནས
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, in order to understand the origin as related to knowledge of liberation, I wondered how I could free my mind from all observation and attachment to miserable things. With that in mind,

source: རྣམ་པར་ཐར་པར་འགྱུར་བ་དང་རྣམ་པར་ཐར་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་འགྱུར་བའི་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: I created a countless variety of roots of virtue to gain liberation and to understand the origin as related to knowledge of liberation.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་ཞེས་བྱ་བ་འགྲོ་བ་ལ་ཕན་པར་བྱ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོས་ཡང་དག་པར་རབ་ཏུ་གནས་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་འཆིང་བ་གཅོད་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Well-Considered Intelligence who, in order to help beings, was suffused by great compassion and determined to sever all beings’ fetters.

source: གལ་ཏེ་བདག་ཡེ་ཤེས་གང་གིས་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཆིང་བ་གཅོད་པའི་ཡེ་ཤེས་དེ་རྟོགས་པར་བྱའོ་སྙམ་མོ། །
en: ‘What sort of wisdom will enable me to sever my and all sentient beings’ fetters?’

source: དེ་ཡེ་ཤེས་དེ་རྟོགས་པར་བྱ་བའི་དོན་དུ་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་ལྷག་པར་ཆགས་པར་མི་བྱེད་དོ། །
en: In order to realize that wisdom he did not let himself become attached to any possessions.

source: ལྷག་པར་ཆགས་པ་མེད་པ་ན་འདི་ལྟར་སོ་སོར་རྟོག་སྟེ།
en: Without any such attachment, he wondered,

source: ཆོས་གང་ལ་བསླབས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཀུན་འབྱུང་བ་རབ་ཏུ་ཤེས་པའི་ཆོས་གཅིག་པོ་གང་ཡང་ཡོད་དམ།
en: ‘Is there one thing which, when cultivated, leads to knowledge of all sentient beings’ origin ?’

source: ཐམས་ཅད་མཁྱེན་པའི་ཐུགས་མ་གཏོགས་པར་གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཀུན་འབྱུང་བ་ཤེས་པར་འགྱུར་བའི་ཆོས་གཅིག་པོ་ནི་མེད་དོ་སྙམ་མོ། །
en: ‘Apart from the omniscient mind, there is nothing that brings knowledge of all sentient beings’ origin .

source: ཐམས་ཅད་མཁྱེན་པའི་ཐུགས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་ཏེ།
en: Bodhisattvas who attain the omniscient mind aspire to awaken.

source: གང་བདག་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་པ་ནི་དེ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་བསྐྱེད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: So, aspiring to awaken, and thus engendering compassion for all sentient beings, I resolve to attain unsurpassed and perfect awakening.

source: བདག་མ་འོངས་པའི་དུས་ན་ཐམས་ཅད་མཁྱེན་པ་དེ་བཞིན་གཤེགས་པར་གྱུར་ནས་མ་དུལ་བ་རྣམས་འདུལ་བ་དང་། མ་ཞི་བ་ཞི་བར་བགྱིད་པ་དང་། མ་གྲོལ་བ་རྣམས་གྲོལ་བར་བགྱིད་པ་དང་། དབུགས་མ་ཕྱིན་པ་རྣམས་དབུགས་འབྱིན་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ། །
en: When I eventually become an omniscient thus-gone one, I will guide those who lack guidance, pacify those who lack peace, liberate those who are not liberated, invigorate those who need invigoration, and lead those who have not reached nirvāṇa to nirvāṇa.’

source: བདག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ལ་འཇུག་པར་བྱེད་པའི་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་བསྙེན་བཀུར་བྱ་བ་གང་ཡིན་སྙམ་མོ། །
en: ‘Which venerable ascetic or brahmin will set me on the path to omniscience?’

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུད་རྩིས་དབང་བསྐུར་ཅེས་བྱ་བ་ནས་རྒྱ་ཆེར་སྦྱར་ཏེ།
en: “At that time there had appeared in the world a thus-gone, worthy, perfect buddha named Anointed with Ambrosia;

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་རྒྱལ་པོ་འཇིགས་བྱེད་བླ་མ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཞིག་བྱུང་ངོ་། །
en: In his buddha realm there was a king named Wrathful Master who was a bodhisattva.

source: རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་དེ་མ་མཐོང་བའི་གྲོགས་པོ་ཡོན་ཏན་གྱི་གྲོགས་པོ། ཆོས་ཀྱི་གྲོགས་པོ་ཡིན་ནོ། །དེས་རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་དེ་ལ་གྲོགས་པོ་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་དེ་ཐམས་ཅད་མཁྱེན་པ། ཐམས་ཅད་གཟིགས་པ། ཡོན་ཏན་དང་སྐྱོན་ཐམས་ཅད་མཁྱེན་པ་ཞིག་འཇིག་རྟེན་དུ་བྱུང་ངོ་ཞེས་ཐོས་ཏེ
en: He was an unseen friend, a qualified friend, and a spiritual friend of King Well-Considered Intelligence. So when this king heard that the thus-gone Anointed with Ambrosia—the omniscient one, the all-seeing one, the one who sees every quality and flaw—had appeared in the world,

source: འདོང་བར་བྱ་བ་ནས་བསྙེན་བཀུར་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ཕོ་ཉ་བཏང་ངོ་། །
en: he dispatched a messenger to King Well-Considered Intelligence, telling the messenger to set off and to serve him.

source: ཕོ་ཉ་དེས་བཀའ་བཞིན་འཚལ་ཞེས་
en: “The messenger said,

source: རྒྱལ་པོ་འཇིགས་བྱེད་བླ་མའི་ལྟར་མཉན་ནས། རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: ‘I will obey your command,’ and, heeding King Wrathful Master’s words, he went before King Well-Considered Intelligence.

source: རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་ལ་རྒྱལ་པོ་ཞེས་མང་དུ་བརྗོད་ནས་སྤྲིང་ཡིག་ཕུལ་ཏེ་ཚིག་ཀྱང་སྨྲས་པ།
en: After repeatedly addressing the king with respect, he presented the letter, reading it aloud:

source: རྒྱལ་པོ་ཆེན་པོ་དོན་གྱི་དུས་ལགས། ཆོས་ཀྱི་དུས་ལགས། ཉེ་བར་གཤེགས་པའི་དུས་ལགས་སོ། །
en: ‘O Your Majesty, this is a meaningful era, a spiritual era, an era of arrival.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་ཞེས་བགྱི་བ་འཇིག་རྟེན་དུ་བྱུང་བ་ནི་ཡོན་ཏན་བསྔགས་པ་དཔག་ཏུ་མེད་པ་དང་ལྡན་ནོ་ཞེས་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་དེའི་བསྔགས་པ་བརྗོད་དོ། །དེ་ནས་རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་དེ་དེ་བཞིན་གཤེགས་པ་དེ་ཞེས་སྒྲ་ཐོས། བདུད་རྩིས་དབང་བསྐུར་ཞེས་སྒྲ་ཐོས་ནས།
en: Your Majesty, the thus-gone one known as Anointed with Ambrosia has appeared in the world. He possesses countless praiseworthy qualities.’ Praising the thus-gone Anointed with Ambrosia in this way, King Well-Considered Intelligence learned of the Thus-Gone One and heard his name.

source: སེང་གེའི་ཁྲི་ལས་བབས་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ངས་ལ་བཙུགས་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་དེ་ལ་ཕྱག་འཚལ་ལོ། །ཕྱག་འཚལ་ལོ་ཞེས་ལན་གསུམ་དུ་ཆེད་དུ་རྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: “He then descended his lion throne and, kneeling on his right knee with his palms together, uttered three times, ‘Homage to the thus-gone Anointed with Ambrosia!’

source: དེའི་ཚེ་དེ་རིངས་པ་ཉིད་དུ་ཚུལ་དང་འཐུན་པའི་བཞོན་པ་བཟང་པོ་བཤམས་ནས་བཞོན་པ་བཟང་པོ་དེ་ལ་ཞོན་ཏེ།
en: Then he swiftly prepared a proper, superb steed, which he proceeded to mount.

source: བློན་པོའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། སྐྱེ་བོའི་ཚོགས་མང་པོ་དང་ལྷན་ཅིག་ཏུ། རྒྱལ་པོ་འཇིགས་བྱེད་བླ་མ་དེ་ག་ལ་བ་དེར་སོང་སྟེ་
en: Surrounded by an entourage of ministers, he then headed off toward King Wrathful Master along with a great many people.

source: ཕྱིན་ནས་གྲོགས་པོའི་ཆོས་ཚུལ་བྱས་ནས་དྲིས་པ།
en: Once he had arrived, he asked in a friendly manner,

source: གྲོགས་པོ་དེ་བཞིན་གཤེགས་པ་ག་ལ་བཞུགས་གསུངས།
en: ‘My friend, where does the Thus-Gone One reside?’

source: གྲོགས་པོ་རེ་ཞིག་ཁ་ཟས་ཀྱི་བྱ་བ་བྱས་ཏེ། ཕྱིས་དེ་བཞིན་གཤེགས་པ་བསྟན་ཏོ། །
en: “ ‘My friend,’ said King Well-Considered Intelligence, ‘it will be a feast just to behold the Thus-Gone One.’

source: དེ་ནས་རྒྱལ་པོ་འཇིགས་བྱེད་བླ་མས་རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་ལྟར་མཉན་ནས། བློ་གྲོས་ལེགས་བསམས་བློན་པོའི་འཁོར་དང་བཅས་པ་དེ་དང་ལྷན་ཅིག་སྲོག་ཆགས་ཁྲི་ཕྲག་བརྒྱད་ཅུ་རྩ་དྲུག་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོས་རྒྱལ་པོའི་ཕོ་བྲང་རིན་ཆེན་ཅན་ནས་བྱུང་སྟེའབྱུང་པོ་ཐམས་ཅད་སྒྲོགས་པ་ཞེས་བྱ་བའི་སྐྱེད་མོས་ཚལ་གང་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་དེ་ག་ལ་བ་དེར་སོང་ངོ་། །
en: “King Wrathful Master heeded King Well-Considered Intelligence’s request, and so, with the great pomp and power of royalty, they left the jeweled palace together with King Well-Considered Intelligence’s entourage of ministers and eight hundred sixty thousand other beings, traveling to a grove called ‘Resounding of All Spirits’ where the blessed thus-gone Anointed with Ambrosia resided.

source: ཇི་ཙམ་དུ་བཞོན་པར་བྱ་བའི་ས་དེ་ཙམ་དུ་བཞོན་པས་སོང་ནས་བཞོན་པ་ལས་བབས་ཏེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་དེ་ག་ལ་བ་དེར་སོང་ནས་མཐོང་ངོ་། །
en: Once they had ridden as far as they needed, they dismounted and went before the blessed thus-gone Anointed with Ambrosia.

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་དེས་ཀྱང་རྒྱལ་པོ་གཉིས་པོ་དེ་དག་སྐྱེ་བོའི་ཚོགས་མང་པོ་དེ་དང་རྒྱང་རིང་པོ་ནས་འདིར་འོང་བ་གཟིགས་ནས་ཏ་ལའི་སྲིད་ཙམ་དུ་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ཏེ་འཆག་གོ། །
en: Seeing that the two kings and the large assembly of beings had traveled a great distance to arrive there, the thus-gone Anointed with Ambrosia levitated into the sky about the height of a palm tree.

source: འཆག་པ་ན་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་དེའི་སྐུའི་སྨད་ལས་ཆུའི་རྒྱུན་རབ་ཏུ་ཕབ་བོ། །སྐུའི་སྟོད་ལས་མེ་རབ་ཏུ་འབར་རོ། །
en: Levitating there, the thus-gone Anointed with Ambrosia let a stream of water pour down from his lower body and flames blaze from his upper body.

source: འདོད་པ་ན་སྤྱོད་པའི་ལྷ་དག་གིས་ཀྱང་ལྷའི་གདུགས་འཛིན་ཅིང་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་ཀྱང་རབ་ཏུ་འཐོར་རོ། །
en: Gods of the desire realm held up parasols and scattered divine mandārava flowers.

source: དེ་ནས་རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་གཞལ་དུ་མེད་པའི་དད་པ་བསྐྱེད་ནས་
en: As soon as King Well-Considered Intelligence saw the Thus-Gone One, he felt immense faith.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་མ་ཐག་ཏུ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: He set his resolve on unsurpassed and perfect awakening, and immediately achieved acceptance that phenomena are unborn.

source: དེས་ན་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིས་དབང་བསྐུར་ལ་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྟོད་པ།
en: He then praised the thus-gone Anointed with Ambrosia in verse:

source: གཟུགས་ཀུན་དཔེ་མེད་ཁམས་གསུམ་དག་ལས་ཁྱད་པར་འཕགས། །
en: “ ‘Your body is matchless, better than that of anyone in the three realms.

source: འདྲེན་པ་ཁྱོད་ལ་དཔེར་བྱ་ནུས་པ་སུ་མ་མཆིས། །
en: O Guide, no one could be compared to you.

source: སེམས་ཅན་ཁ་ལོ་སྒྱུར་བའི་གཟུགས་གང་དཔེར་བྱ་བ། །
en: You appear as a leader of beings.

source: དེ་ལྟར་ཁྱོད་ཀྱི་གཟུགས་དང་འདྲ་བ་གང་མ་མཆིས། །
en: In that way your body is incomparable.

source: ཁྱོད་ཀྱི་གཟུགས་ནི་སེམས་ཀྱིས་གྲུབ་སྟེ་གང་འདྲ་བ། །
en: “ ‘Your body is accomplished by mind.

source: གང་གིས་ཁྱོད་ཀྱི་དཔེར་འགྱུར་ཁམས་གསུམ་འདི་ན་མེད། །
en: Thus, no one in the three realms compares to you.

source: བདག་གཟུགས་འདི་འདྲར་གྱུར་ཅིག་ཡེ་ཤེས་འདི་འདྲར་ཤོག །
en: May my body become like yours; may I have such wisdom.’

source: གང་གིས་འགྲོ་བ་འཁོར་བའི་བཙོན་རར་བཅིངས་འགྲོལ་བ། །
en: The liberator of beings bound in the dungeon of saṃsāra,

source: དེའི་སེམས་རྐང་གཉིས་མཆོག་གིས་མཁྱེན་ནས་ལུང་བསྟན་པ། །
en: “The foremost of humans, was aware of his thoughts, and prophesied:

source: རྣམ་འདྲེན་མཆོག་ཐོབ་མིང་ནི་སྲེད་མེད་བུ་ཞེས་བྱ། །
en: ‘You will achieve the level of a supreme guide named Nārāyaṇa.’

source: བདུད་རྩིའི་དབང་བསྐུར་རྫོགས་རྒྱས་རྐང་གཉིས་མཆོག་ཏུ་འགྱུར། །
en: When everyone heard the prophesy of Anointed with Ambrosia,

source: འཇིག་རྟེན་སྟོན་པ་བླ་མེད་སེམས་ཅན་བྱེ་བ་འདྲེན། །
en: The perfect buddha, foremost of humans, teacher of the world,

source: དེ་ཚེ་དེ་ཡི་ལུང་བསྟན་སྐྱེ་བོ་ཀུན་གྱིས་ཐོས་ནས་སུ། །བྱང་ཆུབ་སེམས་བསྐྱེད་དེ་དག་ཀྱང་ནི་འདྲེན་པས་ལུང་བསྟན་པ། །
en: “And peerless guide of beings, they aroused the will to awaken, And the Guide prophesied about them as well.

source: རྒྱལ་བས་འགྲོ་བ་མ་ལུས་ཐམས་ཅད་བྱང་ཆུབ་ལུང་བསྟན་ཏོ། །
en: The Victor prophesied everyone’s awakening.

source: རྒྱལ་ལ་ཡང་དག་བསྙེན་བཀུར་བྱས་ནས་བྱང་ཆུབ་ཕ་རོལ་འགྲོ། །
en: They venerated the Victor before passing into awakening.

source: མཁས་པ་འཇིག་རྟེན་དོན་བྱས་སངས་རྒྱས་དེ་ཀུན་མྱ་ངན་འདས། །
en: “All those wise buddhas who benefitted the world then passed into nirvāṇa.

source: དེ་ལྟར་རྫོགས་པའི་བྱང་ཆུབ་དེ་དག་བློ་མཆོག་ཤིན་ཏུ་སྐྱེས། །
en: In that way they formed the supreme will toward complete awakening.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time King Well-Considered Intelligence was anyone else, do not think so.

source: དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་དེ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་བློ་གྲོས་ལེགས་བསམས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days the thus-gone Kāśyapa was King Well-Considered Intelligence.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འཇིགས་བྱེད་བླ་མ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time King Wrathful Master was anyone else, do not think so.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། །
en: Why is that?

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འཇིགས་བྱེད་བླ་མ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: Because in those days I was King Wrathful Master.

source: དེས་ན་ང་རྣམ་པར་ཐར་པ་ཤེས་པ་ལ་ངེས་པར་གྱུར་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: Gaining conviction in the knowledge of liberation, I achieved acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་རྣམ་པར་ཐར་པ་ཤེས་པ་ཀུན་འབྱུང་བ་རྟོགས་པར་བྱ་བའི་ཕྱིར་དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་བཀུར་བྱ་ཞིང་། ཡོངས་སུ་འདྲི་བའི་རང་བཞིན་ཅན་དུ་ཡང་བྱའོ། །
en: Therefore, Maudgalyāyana, in order to understand the origin as related to knowledge of liberation, bodhisattvas should venerate their spiritual guides and cultivate a character of inquisitiveness.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་བཤེས་གཉེན་གྱི་ལག་ཏུ་སོང་བ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Maudgalyāyana, bodhisattvas who are in the hands of a spiritual guide swiftly become irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་རྣམ་པར་ཐར་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་ཞི་བ་རྣམ་པར་ཐར་པ་དག་གི་འགོག་པ་ཤེས་པ་རྟོགས་ནས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Furthermore, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand cessation as related to knowledge of liberation. I did this by realizing knowledge of the cessation of peaceful liberation and then wondering how to teach this genuinely to sentient beings.
